In [1]:
import pandas as pd
import numpy as np

In [108]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [171]:
# 4
df = pd.DataFrame(data, index= labels)
df.loc['a':'h', 'animal':'visits']

  animal  age  visits
a    cat  2.5       1
b    cat  3.0       3
c  snake  0.5       2
d    dog  NaN       3
e    dog  5.0       2
f    cat  2.0       3
g  snake  4.5       1
h    cat  NaN       1

In [6]:
#5
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [7]:
# 6
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [13]:
# 7
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [26]:
# 7
df.loc[:, 'animal':'visits']

  animal  age  visits
a    cat  2.5       1
b    cat  3.0       3
c  snake  0.5       2
d    dog  NaN       3
e    dog  5.0       2
f    cat  2.0       3
g  snake  4.5       1
h    cat  NaN       1
i    dog  7.0       2
j    dog  3.0       1

In [31]:
# 8
df.iloc[[3, 4, 8], 0:2]

df.loc[df.index[[3, 4, 8]], 'animal':'age']

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [35]:
# 9
df[df['visits'] >= 3]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

In [36]:
# 10
df[df['age'].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [41]:
# 11
df[(df['animal'] == 'cat') & (df['age']<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [45]:
# 12
df[df['age'].between(2, 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [52]:
# 13

df.loc['f', 'age'] = 1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [55]:
# 14
df['visits'].sum()

19

In [61]:
# 15
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [70]:
# 16
df.loc['k'] = ['cow', 3.5, 1, 'yes']
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
k    cow  3.5       1      yes

In [84]:
df.drop('k')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [80]:
# 17
df['animal'].value_counts()

cat      4
dog      4
snake    2
cow      1
Name: animal, dtype: int64

In [89]:
# 18
df.sort_values('age', ascending=False)
df.sort_values('visits')

df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
k    cow  3.5       1      yes
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

In [134]:
# 19
df['priority'] = df['priority'].replace(to_replace=['yes', 'no'], value=[True, False])

# df['priority'].replace({'yes': True, 'no': False})

In [135]:
# 20
df['animal'] = df['animal'].replace({'snake':'python'})

In [165]:
# 21
df.pivot_table(values='age', index='animal', columns='visits', aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
python  4.5  0.5  NaN

In [172]:
# 22
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [173]:
# 22
df[df.index == df['A']]

   A
2  2
3  3
4  4
5  5

In [181]:
df['A'].shift()

0     NaN
1     1.0
2     2.0
3     2.0
4     3.0
5     4.0
6     5.0
7     5.0
8     5.0
9     6.0
10    7.0
Name: A, dtype: float64

In [247]:
# 23
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.551195  0.678788  0.930333
1  0.096404  0.040087  0.399358
2  0.691216  0.825619  0.016507
3  0.198759  0.382932  0.556123
4  0.589455  0.464990  0.212179

In [194]:
# 23
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0 -0.460237  0.280643  0.179594
1 -0.197966  0.148865  0.049101
2  0.102691 -0.332243  0.229551
3  0.030913  0.149248 -0.180161
4 -0.038419 -0.211835  0.250253

In [238]:
# 24
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))

'b'

In [244]:
df.sum().idxmin()

'b'

In [249]:
# 25
len(df.drop_duplicates())

5

In [273]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df.loc[0, ['c', 'e', 'g', 'h', 'j']] = np.NaN
df.loc[1, ['a', 'b', 'd', 'i', 'j']]=np.NaN
df.loc[2, ['a', 'c', 'd', 'f', 'i']]=np.NaN
df.loc[3, ['b', 'e', 'f', 'g', 'h']]=np.NaN
df.loc[3, ['c', 'd', 'e', 'f', 'h']]=np.NaN
df

,a,b,c,d,e,f,g,h,i,j
0,0.593654,0.784638,NaN,0.590427,NaN,0.750589,NaN,NaN,0.524243,NaN
1,NaN,NaN,0.130275,NaN,0.828656,0.984110,0.512659,0.581064,NaN,NaN
2,NaN,0.848646,NaN,NaN,0.793464,NaN,0.689743,0.194345,NaN,0.320845
3,0.913569,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.761556,0.769281
4,0.936395,0.688568,0.029294,0.177382,0.054817,0.969375,0.362937,0.651281,0.996551,0.632304

In [285]:
# 26
(df.isnull().cumsum(axis=1) == 3).idxmax(axis=1)

0    g
1    d
2    d
3    d
4    a
dtype: object

In [286]:
# 27
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [311]:
df.sort_values(by=['grps',  'vals'], ascending=[True, False]).groupby('grps').head(3).groupby('grps').sum()

      vals
grps
a      409
b      156
c      345

In [314]:
df.groupby('grps')['vals'].nlargest(3).sum(level=0)

C:\Users\user\AppData\Local\Temp\ipykernel_948\1593056217.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df.groupby('grps')['vals'].nlargest(3).sum(level=0)

grps
a    409
b    156
c    345
Name: vals, dtype: int64

In [316]:
# 28
df = pd.DataFrame({'A': np.arange(1,101), 'B': np.arange(101, 201)})
df

      A    B
0     1  101
1     2  102
2     3  103
3     4  104
4     5  105
..  ...  ...
95   96  196
96   97  197
97   98  198
98   99  199
99  100  200

[100 rows x 2 columns]

In [322]:
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()

A
(0, 10]      1055
(10, 20]     1155
(20, 30]     1255
(30, 40]     1355
(40, 50]     1455
(50, 60]     1555
(60, 70]     1655
(70, 80]     1755
(80, 90]     1855
(90, 100]    1955
Name: B, dtype: int32

In [328]:
# 29
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
df.groupby(df["X"]==0).cumsum()

    X
0   7
1   9
2   0
3  12
4  16
5  18
6  23
7   0
8  26
9  30

In [334]:
(df['X'] == 0).cumsum()

0    0
1    0
2    1
3    1
4    1
5    1
6    1
7    2
8    2
9    2
Name: X, dtype: int32

In [344]:
df['Y'] = df.groupby((df['X'] == 0).cumsum()).cumcount()
# We're off by one before we reach the first zero.
first_zero_idx = (df['X'] == 0).idxmax()

df['Y'].iloc[0:first_zero_idx] += 1
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

          0         1         2
0  0.916249  0.601164  0.259436
1  0.299046  0.699040  0.861053
2  0.521421  0.243025  0.708942
3  0.489310  0.188417  0.023882
4  0.480593  0.964509  0.612494

In [356]:
# 30

df = pd.DataFrame(np.random.random(size=(5, 3)))

In [357]:
print(df)

          0         1         2
0  0.198323  0.048676  0.490887
1  0.135230  0.457125  0.145737
2  0.980637  0.249490  0.979724
3  0.848539  0.710474  0.417780
4  0.243585  0.849347  0.878999

In [360]:
df.unstack().sort_values(ascending=False)[0:3].index

MultiIndex([(0, 2),
            (2, 2),
            (2, 4)],
           )

In [8]:
# 31
df = pd.DataFrame({'grID': [1, 2, 3, 4, 5, 6], 'grps': ['A', 'B', 'A', 'D', 'E', 'B'], 'vals': [5, 8, -9, 4 , -8, 7]})
df

   grID grps  vals
0     1    A     5
1     2    B     8
2     3    A    -9
3     4    D     4
4     5    E    -8
5     6    B     7

In [13]:
def replace(group):
    mask = group<0
    group[mask] = group[~mask].mean()
    return group

df.groupby(['grps'])['vals'].transform(replace)

0    5.0
1    8.0
2    5.0
3    4.0
4    NaN
5    7.0
Name: vals, dtype: float64

In [14]:
# 32
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [34]:
g1 = df.groupby(['group'])['value']              # group values  
g2 = df.fillna(0).groupby(['group'])['value']    # fillna, then group values

s = g2.rolling(3, min_periods=1).sum() / g1.rolling(3, min_periods=1).count() # compute means
s.reset_index(level=0, drop=True).sort_index()  # drop/sort index

0     1.000000
1     1.500000
2     3.000000
3     1.500000
4     1.666667
5     2.000000
6     1.000000
7     1.333333
8     3.666667
9     1.333333
10    3.000000
11    4.000000
Name: value, dtype: float64

In [42]:
# 33
dti = pd.date_range(start='2022-01-01', end='2022-12-31', freq='B') 
s = pd.Series(np.random.rand(len(dti)), index=dti)

2022-01-03    0.537610
2022-01-04    0.538198
2022-01-05    0.707966
2022-01-06    0.183558
2022-01-07    0.856410
2022-01-10    0.335246
2022-01-11    0.314482
2022-01-12    0.440554
2022-01-13    0.947153
2022-01-14    0.060873
2022-01-17    0.493831
Freq: B, dtype: float64

In [40]:
# 34
s[s.index.weekday == 2].sum()

23.002875558988233

In [51]:
# 35
s.groupby(s.index.month).mean()

1     0.472759
2     0.567678
3     0.419215
4     0.467859
5     0.560899
6     0.558197
7     0.503850
8     0.640004
9     0.579065
10    0.503599
11    0.505444
12    0.508093
dtype: float64

In [44]:
s.resample('M').mean()

2022-01-31    0.472759
2022-02-28    0.567678
2022-03-31    0.419215
2022-04-30    0.467859
2022-05-31    0.560899
2022-06-30    0.558197
2022-07-31    0.503850
2022-08-31    0.640004
2022-09-30    0.579065
2022-10-31    0.503599
2022-11-30    0.505444
2022-12-31    0.508093
Freq: M, dtype: float64

In [57]:
# 36
s.groupby(pd.TimeGrouper('4M')).idxmax()

AttributeError: module 'pandas' has no attribute 'TimeGrouper'

In [66]:
# 37
pd.date_range('2015-01-01', '2016-12-31', freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

In [67]:
# 38
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [71]:
s = df['FlightNumber'].shift()
df['FlightNumber'].fillna(s+10).astype(int)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [74]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [84]:
# 39
temp = df['From_To'].str.split('_', expand=True)
temp.columns = ["From", "To"]
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [85]:
# 40
temp['From'] = temp['From'].str.title()
temp['To'] = temp['To'].str.title()
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [90]:
# 41
df = df.drop('From_To', axis=1)

KeyError: "['From_To'] not found in axis"

In [94]:
df = df.join(temp)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [121]:
# 42
df['Airline'] =  df['Airline'].str.extract('([a-zA-Z\s]+)',  expand=False).str.strip()

In [122]:
df

   FlightNumber  RecentDelays          Airline      From         To
0         10045      [23, 47]              KLM    London      Paris
1         10055            []       Air France    Madrid      Milan
2         10065  [24, 43, 87]  British Airways    London  Stockholm
3         10075          [13]       Air France  Budapest      Paris
4         10085      [67, 32]        Swiss Air  Brussels     London

In [133]:
# 43
delays = df['RecentDelays'].apply(pd.Series)
delays.columns = ['delay_1', 'delay_2', 'delay_3']
delays
df = df.drop('RecentDelays', axis=1).join(delays)
df

C:\Users\user\AppData\Local\Temp\ipykernel_5948\23466680.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  delays = df['RecentDelays'].apply(pd.Series)

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN

In [137]:
# 44
letters = ['A', 'B', 'C']
numbers = list(range(10))

mi = pd.MultiIndex.from_product([letters, numbers])
s = pd.Series(np.random.rand(30), index=mi)
s

A  0    0.650546
   1    0.859950
   2    0.432475
   3    0.874220
   4    0.478888
   5    0.903721
   6    0.822864
   7    0.480010
   8    0.278720
   9    0.095863
B  0    0.507875
   1    0.708290
   2    0.237532
   3    0.552637
   4    0.501678
   5    0.708544
   6    0.245923
   7    0.541876
   8    0.364617
   9    0.906882
C  0    0.381274
   1    0.334181
   2    0.597317
   3    0.467107
   4    0.142915
   5    0.454439
   6    0.430010
   7    0.232107
   8    0.338176
   9    0.886308
dtype: float64

In [138]:
# 45
s.index.is_lexsorted()

C:\Users\user\AppData\Local\Temp\ipykernel_5948\2503264109.py:2: FutureWarning: MultiIndex.is_lexsorted is deprecated as a public function, users should use MultiIndex.is_monotonic_increasing instead.
  s.index.is_lexsorted()

True

In [142]:
# 46
s.loc[:, [1, 3, 6]]

A  1    0.859950
   3    0.874220
   6    0.822864
B  1    0.708290
   3    0.552637
   6    0.245923
C  1    0.334181
   3    0.467107
   6    0.430010
dtype: float64

In [140]:
# 47
s.loc[:'B', 5:]

A  5    0.903721
   6    0.822864
   7    0.480010
   8    0.278720
   9    0.095863
B  5    0.708544
   6    0.245923
   7    0.541876
   8    0.364617
   9    0.906882
dtype: float64

In [150]:
# 48
s.sum(level=0)

C:\Users\user\AppData\Local\Temp\ipykernel_5948\1666796226.py:2: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  s.sum(level=0)

A    5.877258
B    5.275854
C    4.263835
dtype: float64

In [152]:
# 49
s.unstack().sum(axis =1)

A    5.877258
B    5.275854
C    4.263835
dtype: float64

In [159]:
# 50
s.swaplevel(0, 1).sort_index()
# s.is_monotonic_increasing
# s.

0  A    0.650546
   B    0.507875
   C    0.381274
1  A    0.859950
   B    0.708290
   C    0.334181
2  A    0.432475
   B    0.237532
   C    0.597317
3  A    0.874220
   B    0.552637
   C    0.467107
4  A    0.478888
   B    0.501678
   C    0.142915
5  A    0.903721
   B    0.708544
   C    0.454439
6  A    0.822864
   B    0.245923
   C    0.430010
7  A    0.480010
   B    0.541876
   C    0.232107
8  A    0.278720
   B    0.364617
   C    0.338176
9  A    0.095863
   B    0.906882
   C    0.886308
dtype: float64